docs: clarify metrics visualization instructions. Removed unused docker-compose.yml
